000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/ОповещенияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователей</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Копия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытаяКопия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.НастройкиБотов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОповещения</name>
    <type>
      <types>EnumRef.СпособыОповещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СпособыОповещения/СпособыОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОповещения</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочтыSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочтыPOP3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPАутентификация</name>
    <type>
      <types>EnumRef.ВариантыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособSMTPАутентификации</name>
    <type>
      <types>EnumRef.СпособыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособPOP3Аутентификации</name>
    <type>
      <types>EnumRef.СпособыPOP3Аутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортIMAP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьIMAP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПротоколаEMAIL</name>
    <type>
      <types>EnumRef.ТипПротоколаEMAIL</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЗащищеннаяАутентификацияIMAP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLIMAP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>АдминистраторАвтоматов</name>
      <description>Нуралиев Борис Георгиевич</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОповещенияПользователей/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Оповещение пользователей".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
//  Содержит общие серверные процедуры предназначенные для настройки, а также 
//  формирования сообщений по оповещениям пользователей.
//

#Область ПрограммныйИнтерфейс

// (Устаревшее) Выполняет оповещение пользователей
//
// Параметры:
//  Событие			 - ПеречислениеСсылка.ТипыСобытийОповещений - предопределенное событие оповещения 
//  СсылкаНаОбъект	 - ДокументСсылка - ссылка на объект, по которому проводим оповещение
//  ТелоСообщения	 - Строка	 - текст оповещения
//  ТипТекста		 - Строка	 - тип текста оповещения
//
Процедура ВыполнитьОповещение(Событие, СсылкаНаОбъект = Неопределено, ТелоСообщения = "", ТипТекста = "") Экспорт

	ВыполнитьОповещениеПоЭлектроннойПочте(Событие, СсылкаНаОбъект, ТелоСообщения, ТипТекста);
		
КонецПроцедуры

// (Устаревшее). Отправляет произвольное электронное письмо пользователю через системную учетную запись
//
// Параметры:
//   Получатель - Строка - адрес электронной почты или идентификатор получателя
//   Тема - Строка - тема письма
//   Текст - Строка - текст сообщения
//   Копии - Строка - адреса получателей копии через запятую
//   СкрытыеКопии - Строка - адреса получателей скрытой копии через запятую
// 	 Вложения - Соответствие - вложения письма:
//                Ключ - наименованиеВложения - Строка - наименование вложения
//                Значение - ДвоичныеДанные - данные вложения
Процедура ВыполнитьПроизвольноеОповещение(Получатель, Тема = "", Текст = "", Копии = Неопределено, СкрытыеКопии = Неопределено, Вложения = Неопределено) Экспорт

	УчетнаяЗаписьДляОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	ПараметрыПисьма = ПолучитьПараметрыЭлектроннаяПочтаПроизвольные(Получатель, Тема, Текст, Копии, СкрытыеКопии, Вложения);
	
	РаботаСПочтовымиСообщениями.ОтправитьСообщение(УчетнаяЗаписьДляОтправки, ПараметрыПисьма);
	
КонецПроцедуры

// Возвращает пустую структуру настроек оповещения
//
// Возвращаемое значение:
//   Структура:
//     * СпособОповещения - Произвольный - способ оповещения
//     * ТипТекста - Строка - тип текста сообщения
//     * ТелоСообщения - Строка - текст сообщения
//     * ЗаголовокСообщения - Строка - заголовок сообщения
//     * Копии - Произвольный - получатели копий
//     * СкрытыеКопии - Произвольный - получатели скрытых копий
//     * Мессенджер - Строка - идентификатор мессенджера
//     * Бот - Произвольный - бот для отправки
Функция ПолучитьСтруктуруНастроекОповещения() Экспорт
	
	Настройки = Новый Структура();
	Настройки.Вставить("СпособОповещения", 	 Неопределено);
	Настройки.Вставить("ТипТекста", 		 "");
	Настройки.Вставить("ТелоСообщения", 	 "");
	Настройки.Вставить("ЗаголовокСообщения", "");
	Настройки.Вставить("Копии", 			 Неопределено);
	Настройки.Вставить("СкрытыеКопии", 		 Неопределено);
	Настройки.Вставить("Мессенджер", 	 	 "telegram");
	Настройки.Вставить("Бот", 	 	 		 Неопределено);
		
	Возврат Настройки;	
	
КонецФункции

// Выполняет оповещение пользователей
//
// Параметры:
//  Событие			 - ПеречислениеСсылка.ТипыСобытийОповещений - предопределенное событие оповещения 
//  НастройкиОповещения - Структура - данные для выполнения оповещения
//  СсылкаНаОбъект	 - ДокументСсылка - ссылка на объект, по которому проводим оповещение
//
Процедура ВыполнитьОповещениеПользователей(Событие, НастройкиОповещения, СсылкаНаОбъект = Неопределено) Экспорт

	СпособОповещенияПользователя 	= СвойствоСтруктуры(НастройкиОповещения, "СпособОповещения");
	ТелоСообщения 					= СвойствоСтруктуры(НастройкиОповещения, "ТелоСообщения", "");
	ДокументИсточник				= ?(ЗначениеЗаполнено(СсылкаНаОбъект), СсылкаНаОбъект, Неопределено);
	
	Если СпособОповещенияПользователя = Неопределено ИЛИ СпособОповещенияПользователя = Перечисления.СпособыОповещения.Email Тогда
		
		ТипТекста = СвойствоСтруктуры(НастройкиОповещения, "ТипТекста", "");
		
		ВыполнитьОповещениеПоЭлектроннойПочте(Событие, ДокументИсточник, ТелоСообщения, ТипТекста);
		
	КонецЕсли;

	Если СпособОповещенияПользователя = Неопределено ИЛИ СпособОповещенияПользователя = Перечисления.СпособыОповещения.Telegram Тогда
		
		Мессенджер = "Telegram";
		
		ВыполнитьОповещениеПоМессенджеру(Событие, ДокументИсточник, Мессенджер, ТелоСообщения);
		
	КонецЕсли;	
		
КонецПроцедуры

// Выполняет произвольное оповещение пользователей
//
// Параметры:
//  Получатель	 - СправочникСсылка.Пользователи - ссылка на пользователя, которому отправляем оповещение
//  НастройкиОповещения - Структура - данные для выполнения оповещения
//
Процедура ВыполнитьПроизвольноеОповещениеПользователей(Получатель, НастройкиОповещения) Экспорт

	СпособОповещенияПользователя 	= СвойствоСтруктуры(НастройкиОповещения, "СпособОповещения");
	ТелоСообщения 					= СвойствоСтруктуры(НастройкиОповещения, "ТелоСообщения", "");
	ЗаголовокСообщения				= СвойствоСтруктуры(НастройкиОповещения, "ЗаголовокСообщения", "");
	Копии							= СвойствоСтруктуры(НастройкиОповещения, "Копии");
	СкрытыеКопии					= СвойствоСтруктуры(НастройкиОповещения, "СкрытыеКопии");
	Бот								= СвойствоСтруктуры(НастройкиОповещения, "Бот");
		
	// має бути визначено конкретний спосіб сповіщення
	Если СпособОповещенияПользователя = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ПустаяСтрока(ТелоСообщения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если СпособОповещенияПользователя = Перечисления.СпособыОповещения.Email Тогда
		
		ВыполнитьОповещениеПоЭлектроннойПочтеПроизвольное(Получатель, ЗаголовокСообщения, ТелоСообщения, Копии, СкрытыеКопии);
		
	ИначеЕсли СпособОповещенияПользователя = Перечисления.СпособыОповещения.Telegram Тогда
		
		ВыполнитьОповещениеПоМессенджеруПроизвольное(Получатель, Бот, "Telegram", ТелоСообщения);
		
	КонецЕсли;
		
КонецПроцедуры	

// Отправляет уведомление по электронной почте на основе указанного события. 
// Тело письма формируется подстановкой номера и даты объекта при наличии ссылки.
//
// Параметры:
//   Событие - Строка - идентификатор события, по которому выполняется отправка уведомления
//   СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект, номер и дата которого подставляются в тело письма
//   ТелоСообщения - Строка - текст сообщения, который заменяет стандартное тело письма
//   ТипТекста - Строка - тип текста сообщения (например, "HTML", "Plain")
Процедура ВыполнитьОповещениеПоЭлектроннойПочте(Событие, СсылкаНаОбъект = Неопределено, ТелоСообщения = "", ТипТекста = "") Экспорт

	УчетнаяЗаписьДляОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	ПараметрыПисем = ПолучитьПараметрыЭлектроннаяПочта(Событие); 
	
	Для Каждого ПараметрыПисьма ИЗ ПараметрыПисем Цикл 
		
		Если СсылкаНаОбъект <> Неопределено Тогда
			
			ПараметрыПисьма.Тело = СтрЗаменить(ПараметрыПисьма.Тело, "[Номер]", СсылкаНаОбъект.Номер);
			ПараметрыПисьма.Тело = СтрЗаменить(ПараметрыПисьма.Тело, "[Дата]" , Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy"));	
			
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(ТелоСообщения) Тогда	
			ПараметрыПисьма.Тело = ТелоСообщения;	
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТипТекста) Тогда
			ПараметрыПисьма.Вставить("ТипТекста", ТипТекста);
		КонецЕсли;	
		
		РаботаСПочтовымиСообщениями.ОтправитьСообщение(УчетнаяЗаписьДляОтправки, ПараметрыПисьма);
		
	КонецЦикла;
	
КонецПроцедуры

// Отправляет электронное письмо с произвольным содержимым через системную учетную запись почты.
//
// Параметры:
//  Получатель - Строка - адрес электронной почты получателя
//  ТемаСообщения - Строка - тема письма
//  ТелоСообщения - Строка - текст письма
//  Копии - Строка, Массив из Строка - адреса копий через запятую или массив адресов
//  СкрытыеКопии - Строка, Массив из Строка - адреса скрытых копий через запятую или массив адресов
//  Вложения - Соответствие - вложения письма:
//                Ключ - наименованиеВложения - Строка - наименование вложения
//                Значение - ДвоичныеДанные - данные вложения
Функция ВыполнитьОповещениеПоЭлектроннойПочтеПроизвольное(Получатель, ТемаСообщения, ТелоСообщения, Копии = Неопределено, СкрытыеКопии = Неопределено, Вложения = Неопределено) Экспорт

	УчетнаяЗаписьДляОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	ПараметрыПисьма = ПолучитьПараметрыЭлектроннаяПочтаПроизвольные(Получатель, ТемаСообщения, ТелоСообщения, Копии, СкрытыеКопии, Вложения); 
	
	Возврат РаботаСПочтовымиСообщениями.ОтправитьСообщение(УчетнаяЗаписьДляОтправки, ПараметрыПисьма);
	
КонецФункции

// Выполняет оповещение пользователя через указанный мессенджер.
//
// Параметры:
//   Событие - Структура - параметры события для оповещения
//   СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект, с которым связано событие
//   Мессенджер - Строка - идентификатор мессенджера. По умолчанию: "telegram"
//   ТелоСообщения - Строка - текст сообщения для отправки
Процедура ВыполнитьОповещениеПоМессенджеру(Событие, СсылкаНаОбъект, Мессенджер, ТелоСообщения) Экспорт

	Если НРег(Мессенджер) = "telegram" Тогда
		ВыполнитьОповещениеПоМессенджеру_Telegram(Событие, СсылкаНаОбъект, ТелоСообщения);	
	КонецЕсли;	
	
КонецПроцедуры

// Отправляет оповещение через мессенджер Telegram по указанному событию. Для каждой настройки
// отправки выполняет подстановку параметров из объекта в шаблон сообщения и отправляет результат.
//
// Параметры:
//   Событие - см. ОповещенияПользователей.ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram
//   СсылкаНаОбъект - ЛюбаяСсылка, Неопределено - объект, данные которого подставляются в шаблон.
//                   В шаблоне поддерживаются подстановки: [Номер] - номер объекта, [Дата] - дата объекта
//   ТелоСообщения - Строка - текст сообщения, если передан, то имеет приоритет над шаблоном настроек
Процедура ВыполнитьОповещениеПоМессенджеру_Telegram(Событие, СсылкаНаОбъект, ТелоСообщения) Экспорт

	МассивНастроек = ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram(Событие); 
	
	Для Каждого ДанныеОтправки ИЗ МассивНастроек Цикл 
		
		Если СсылкаНаОбъект <> Неопределено Тогда
			
			ДанныеОтправки.ТекстСообщения = СтрЗаменить(ДанныеОтправки.ТекстСообщения, "[Номер]", СсылкаНаОбъект.Номер);
			ДанныеОтправки.ТекстСообщения = СтрЗаменить(ДанныеОтправки.ТекстСообщения, "[Дата]" , Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy"));	
			
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(ТелоСообщения) Тогда	
			ДанныеОтправки.ТекстСообщения = ТелоСообщения; 	
		КонецЕсли;
		
		ОтправитьСообщениеЧерезМессенджер_Telegram(ДанныеОтправки);
		
	КонецЦикла;
	
КонецПроцедуры

// Отправляет произвольное оповещение пользователю в указанный мессенджер.
//
// Параметры:
//   Получатель - Строка - идентификатор получателя в мессенджере
//   Бот - Строка - токен или идентификатор бота для отправки сообщений
//   Мессенджер - Строка - тип мессенджера. По умолчанию "telegram"
//   ТелоСообщения - Строка - текст отправляемого сообщения
Процедура ВыполнитьОповещениеПоМессенджеруПроизвольное(Получатель, Бот, Мессенджер="telegram", ТелоСообщения) Экспорт

	Если НРег(Мессенджер) = "telegram" Тогда
		ВыполнитьОповещениеПоМессенджеру_Telegram_Произвольное(Получатель, Бот, ТелоСообщения);	
	КонецЕсли;	
	
КонецПроцедуры

// Отправляет произвольное оповещение указанному получателю через мессенджер Telegram
//
// Параметры:
//   Получатель - Строка - идентификатор получателя сообщения
//   Бот - Строка - идентификатор бота Telegram
//   ТелоСообщения - Строка - текст сообщения для отправки
Процедура ВыполнитьОповещениеПоМессенджеру_Telegram_Произвольное(Получатель, Бот, ТелоСообщения) Экспорт

	МассивНастроек = ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram_Произвольные(Получатель, Бот, ТелоСообщения); 
	
	// 1 елемент в масиві завжди
	Если МассивНастроек.Количество() Тогда
		ОтправитьСообщениеЧерезМессенджер_Telegram(МассивНастроек[0]);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ссылку на профиль пользователя в мессенджере Telegram по идентификатору пользователя
//
// Параметры:
//   Пользователь - СправочникСсылка.Пользователи, Строка - ссылка на пользователя или идентификатор пользователя в мессенджере
//   Бот         - СправочникСсылка.НастройкиБотов - настройки бота для выполнения запроса к API мессенджера
//   Мессенджер  - Строка - код мессенджера
// 
// Возвращаемое значение:
//   Строка - ссылка на профиль пользователя в формате "https://t.me/username", или пустая строка - если ссылку не удалось получить
Функция ПолучитьСсылкуНаПрофильПользователя(Пользователь, Бот, Мессенджер="telegram") Экспорт

	СтрокаРезультат = "";
	
	Если НЕ НРег(Мессенджер)="telegram" Тогда
		Возврат СтрокаРезультат;
	КонецЕсли;	
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		ИдентификаторПользователя = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Пользователь, Справочники.ВидыКонтактнойИнформации.TelegramПользователя);
	Иначе
		ИдентификаторПользователя = Пользователь;
	КонецЕсли;	

	Если ПустаяСтрока(ИдентификаторПользователя) Тогда
		Возврат СтрокаРезультат;
	КонецЕсли;	
	
	ПараметрыПодключенияБот = ПолучитьПараметрыПодключения(Бот);
	
	// запит
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("chat_id", ИдентификаторПользователя);
	
	ОтветСервера = Новый Соответствие();
	ОтветОк = ОправитьЗапросНаСерверТелеграм("getChat", ПараметрыПодключенияБот, ПараметрыЗапроса, ОтветСервера);

	Если ОтветОк Тогда
		ПровильПользователя = ОтветСервера.Получить("username");
		Если Не ПустаяСтрока(ПровильПользователя) Тогда
			СтрокаРезультат = "https://t.me/" + ПровильПользователя;
		КонецЕсли;
	КонецЕсли;	

	Возврат СтрокаРезультат;

КонецФункции

// Отправляет запрос на сервер Telegram и проверяет успешность соединения.
//
// Параметры:
//   Метод - Строка - имя метода API Telegram
//   НастройкиПодключения - Структура:
//     * АдресСервера - Строка
//     * Токен - Строка
//   ДанныеЗапроса - Структура - данные для отправки
//   ОтветСервера - Соответствие - заполняется при успешном соединении
//   ТекстСообщения - Строка - заполняется текстом сообщения о результате операции
//
// Возвращаемое значение:
//   Булево - Истина при успешном выполнении запроса
Функция ОправитьЗапросНаСерверТелеграм(Метод, НастройкиПодключения, ДанныеЗапроса, ОтветСервера = Неопределено, ТекстСообщения = "") Экспорт   

	Если ОтветСервера = Неопределено Тогда
		ОтветСервера = Новый Соответствие();
	КонецЕсли;
	
	СтрокаПодключения = НастройкиПодключения.АдресСервера
		+ "/bot"
		+ НастройкиПодключения.Токен
		+ "/" + СокрЛП(Метод); 

	Результат = КоннекторHTTP.PostJson(СтрокаПодключения, ДанныеЗапроса);
	
	ОтветОк = Результат.Получить("ok") = Истина;
	Если ОтветОк Тогда
		
		ТекстСообщения = НСтр("ru='Соединение с сервером успешно установлено.';uk='З''єднання з сервером успішно встановлено.'");
		ОтветСервера = Результат.Получить("result");
	
	Иначе
		
		ТекстСообщения = НСтр("ru='Не удалось установить соединение.';uk='Не вдалося встановити з''єднання.'");
		ОтветСервера = Результат.Получить("description");
		
	КонецЕсли;

	Возврат ОтветОк;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеФункции_ЭлектроннаяПочта

Функция ПолучитьПараметрыЭлектроннаяПочта(Событие) Экспорт

	ПараметрыПисем = Новый Массив;
	ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	
	// Якщо запит порожній - по такому Событие немає активних настройок або у користувача не заданий емейл 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОповещенияПользователей.Пользователь.Наименование КАК НаименованиеПолучателя,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.АдресЭП, """") КАК АдресЭП,
	|	ОповещенияПользователей.Тема КАК Тема,
	|	ОповещенияПользователей.Текст КАК Текст,
	|	ОповещенияПользователей.Копия КАК Копия,
	|	ОповещенияПользователей.СкрытаяКопия КАК СкрытаяКопия
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ОповещенияПользователей.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|		И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|ГДЕ
	|	ОповещенияПользователей.Событие = &Событие
	|	И ОповещенияПользователей.СпособОповещения = ЗНАЧЕНИЕ(Перечисление.СпособыОповещения.Email)
	|	И ОповещенияПользователей.Активно
	|	И ТИПЗНАЧЕНИЯ(ОповещенияПользователей.Пользователь) = ТИП(Справочник.Пользователи)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователейСостав.Пользователь.Наименование,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.АдресЭП, """"),
	|	ОповещенияПользователей.Тема,
	|	ОповещенияПользователей.Текст,
	|	ОповещенияПользователей.Копия,
	|	ОповещенияПользователей.СкрытаяКопия
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|			ПО ГруппыПользователейСостав.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|			И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|		ПО ОповещенияПользователей.Пользователь = ГруппыПользователейСостав.Ссылка
	|ГДЕ
	|	ОповещенияПользователей.Событие = &Событие
	|	И ОповещенияПользователей.СпособОповещения = ЗНАЧЕНИЕ(Перечисление.СпособыОповещения.Email)
	|	И ОповещенияПользователей.Активно
	|	И ТИПЗНАЧЕНИЯ(ОповещенияПользователей.Пользователь) = ТИП(Справочник.ГруппыПользователей)";
	
	Запрос.УстановитьПараметр("Событие", Событие);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.АдресЭП) Тогда
			Продолжить;
		КонецЕсли;	
		
		ПараметрыПисьма = Новый Структура;
		
		//Кому
		МассивКому = Новый Массив;
		
		СтруктураКому = Новый Структура;
		СтруктураКому.Вставить("Адрес"        , Выборка.АдресЭП); 
		СтруктураКому.Вставить("Представление", Выборка.НаименованиеПолучателя);
		
		МассивКому.Добавить(СтруктураКому);
		
		ПараметрыПисьма.Вставить("Кому", МассивКому);
		
		//Копии
		МассивКопии = Новый Массив;
		
		СписокКопий = Выборка.Копия.Получить();
		                                                                                
		Если СписокКопий <> Неопределено И СписокКопий.Количество() Тогда
			
			Для Каждого Копия ИЗ СписокКопий Цикл
				
				СтруктураКопии = ПолучитьСтруктуруПолучателяЭлектроннойПочты(Копия, ВидКИ);
				
				Если НЕ ПустаяСтрока(СтруктураКопии.Адрес) Тогда
					МассивКопии.Добавить(СтруктураКопии);	
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;		
		
		ПараметрыПисьма.Вставить("Копии", МассивКопии);
		
		//Слепые копии
		МассивСлепыеКопии = Новый Массив;
		
		СписокСлепыхКопий = Выборка.СкрытаяКопия.Получить();
		
		Если СписокСлепыхКопий <> Неопределено И СписокСлепыхКопий.Количество() Тогда
			
			Для Каждого СлепаяКопия ИЗ СписокСлепыхКопий Цикл
				
				СтруктураСлепойКопии = ПолучитьСтруктуруПолучателяЭлектроннойПочты(СлепаяКопия, ВидКИ);
				
				Если НЕ ПустаяСтрока(СтруктураСлепойКопии.Адрес) Тогда
					МассивСлепыеКопии.Добавить(СтруктураСлепойКопии);	
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;		
		
		ПараметрыПисьма.Вставить("СлепыеКопии", МассивСлепыеКопии);
		
		ПараметрыПисьма.Вставить("Тема", Выборка.Тема);
		ПараметрыПисьма.Вставить("Тело", Выборка.Текст);
		
		ПараметрыПисем.Добавить(ПараметрыПисьма);
		
	КонецЦикла;
	
	Возврат ПараметрыПисем;
	
КонецФункции // ПолучитьПараметрыПисем()	

Функция ПолучитьПараметрыЭлектроннаяПочтаПроизвольные(Получатель, Тема, Текст, Копии, СкрытыеКопии, Вложения)

	ПараметрыПисьма = Новый Структура;
	
	//Кому
	МассивКому = Новый Массив();	
	МассивКому.Добавить(ПолучитьСтруктуруПолучателяЭлектроннойПочты(Получатель, Справочники.ВидыКонтактнойИнформации.EmailПользователя));
    	
	ПараметрыПисьма.Вставить("Кому", МассивКому);
	
	//Копии
	Если Копии = Неопределено Тогда		
		ПараметрыПисьма.Вставить("Копии", Новый Массив());
	Иначе
		ПараметрыПисьма.Вставить("Копии", Копии);
	КонецЕсли;
	
	//Слепые копии
	Если СкрытыеКопии = Неопределено Тогда		
		ПараметрыПисьма.Вставить("СлепыеКопии", Новый Массив());
	Иначе
		ПараметрыПисьма.Вставить("СлепыеКопии", СкрытыеКопии);
	КонецЕсли;		
		
	//Вложения
	Если Вложения = Неопределено Тогда		
		ПараметрыПисьма.Вставить("Вложения", Новый Соответствие());
	Иначе
		ПараметрыПисьма.Вставить("Вложения", Вложения);
	КонецЕсли;		
		
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", Текст);
	
	Возврат ПараметрыПисьма;
	
КонецФункции // ПолучитьПараметрыЭлектроннаяПочтаПроизвольные()

Функция ПолучитьСтруктуруПолучателяЭлектроннойПочты(Получатель, ВидКИ) Экспорт 
	
	Если ТипЗнч(Получатель) = Тип("Структура") Тогда
		Возврат Получатель;
	КонецЕсли;	
	
	СтруктураПолучателя = Новый Структура;
	СтруктураПолучателя.Вставить("Адрес"        , ""); 
	СтруктураПолучателя.Вставить("Представление", "");
	
	// может прилететь элемент СЗ или ссылка
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Пользователи") Тогда
		ПолучательСообщения = Получатель;
	Иначе		
		ПолучательСообщения = Получатель.Значение;	
	КонецЕсли;	
	
	Адрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ПолучательСообщения, ВидКИ);
	
	Если НЕ ПустаяСтрока(Адрес) Тогда 
		
		СтруктураПолучателя.Вставить("Адрес"        , Адрес); 
		СтруктураПолучателя.Вставить("Представление", ПолучательСообщения.Наименование);
		
	КонецЕсли;	
	
	Возврат СтруктураПолучателя;
	
КонецФункции // ПолучитьСтруктуруПолучателяЭлектроннойПочты()	

#КонецОбласти

#Область СлужебныеФункции_Telegram

Функция ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram(Событие)
	
	ДанныеВозврат = Новый Массив;
	ВидКИ = Справочники.ВидыКонтактнойИнформации.TelegramПользователя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОповещенияПользователей.Пользователь.Наименование КАК НаименованиеПолучателя,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """") КАК ИдентификаторПользователя,
	|	ОповещенияПользователей.Текст КАК Текст,
	|	ОповещенияПользователей.Копия КАК Копия,
	|	ОповещенияПользователей.Бот КАК Бот,
	|	ОповещенияПользователей.Бот.Токен КАК Токен,
	|	ОповещенияПользователей.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ОповещенияПользователей.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|		И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.TelegramПользователя)
	|ГДЕ
	|	ОповещенияПользователей.Событие = &Событие
	|	И ОповещенияПользователей.СпособОповещения = ЗНАЧЕНИЕ(Перечисление.СпособыОповещения.Telegram)
	|	И ОповещенияПользователей.Активно
	|	И ТИПЗНАЧЕНИЯ(ОповещенияПользователей.Пользователь) = ТИП(Справочник.Пользователи)
	|	И НЕ ПользователиКонтактнаяИнформация.Ссылка.Недействителен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователейСостав.Пользователь.Наименование,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.Представление, """"),
	|	ОповещенияПользователей.Текст,
	|	ОповещенияПользователей.Копия,
	|	ОповещенияПользователей.Бот,
	|	ОповещенияПользователей.Бот.Токен,
	|	ГруппыПользователейСостав.Пользователь КАК Пользовател
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|			ПО ГруппыПользователейСостав.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|			И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.TelegramПользователя)
	|		ПО ОповещенияПользователей.Пользователь = ГруппыПользователейСостав.Ссылка
	|ГДЕ
	|	ОповещенияПользователей.Событие = &Событие
	|	И ОповещенияПользователей.СпособОповещения = ЗНАЧЕНИЕ(Перечисление.СпособыОповещения.Telegram)
	|	И ОповещенияПользователей.Активно
	|	И ТИПЗНАЧЕНИЯ(ОповещенияПользователей.Пользователь) = ТИП(Справочник.ГруппыПользователей)
	|	И НЕ ПользователиКонтактнаяИнформация.Ссылка.Недействителен";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.ИдентификаторПользователя) Тогда
			Продолжить;
		КонецЕсли;	
		
		ПараметрыМессенджер = Новый Структура;
		
		//Кому
		МассивКому = Новый Массив;
		
		СтруктураКому = Новый Структура;
		СтруктураКому.Вставить("Адрес"        , Выборка.ИдентификаторПользователя); 
		СтруктураКому.Вставить("Представление", Выборка.НаименованиеПолучателя);
		
		МассивКому.Добавить(СтруктураКому);
		
		//Копии - добавив в основной массив
		МассивКопии = Новый Массив();
		СписокКопий = Выборка.Копия.Получить();
		                                                                                
		Если СписокКопий <> Неопределено И СписокКопий.Количество() Тогда
			
			Для Каждого Копия ИЗ СписокКопий Цикл
				
				СтруктураКопии = ПолучитьСтруктуруПолучателяЭлектроннойПочты(Копия, ВидКИ);
				
				Если НЕ ПустаяСтрока(СтруктураКопии.Адрес) Тогда
					МассивКопии.Добавить(СтруктураКопии);	
				КонецЕсли;
				
			КонецЦикла;	
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКому, МассивКопии, Истина);
			
		КонецЕсли;		
		
		ПараметрыМессенджер.Вставить("Кому", 			МассивКому);
		ПараметрыМессенджер.Вставить("ТекстСообщения", 	Выборка.Текст);
		ПараметрыМессенджер.Вставить("Бот",  			Выборка.Бот);
		ПараметрыМессенджер.Вставить("ПараметрыПодключения", ПолучитьПараметрыПодключения(Выборка.Бот));
		
		ДанныеВозврат.Добавить(ПараметрыМессенджер);
		
	КонецЦикла;
	
	Возврат ДанныеВозврат;
	
КонецФункции // ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram()	

Функция ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram_Произвольные(Получатель, Бот, ТекстСообщения)

	ДанныеВозврат = Новый Массив;
	ПараметрыМессенджер = Новый Структура;
		
	//Кому
	МассивКому = Новый Массив;
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ИдентификаторТГ = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.TelegramПользователя);
		
		СтруктураКому = Новый Структура;
		СтруктураКому.Вставить("Адрес"        , ИдентификаторТГ); 
		СтруктураКому.Вставить("Представление", СокрЛП(Получатель));
		
		МассивКому.Добавить(СтруктураКому);	
		
	КонецЕсли;	
		
	ПараметрыМессенджер.Вставить("Кому", 			МассивКому);
	ПараметрыМессенджер.Вставить("ТекстСообщения", 	ТекстСообщения);
	ПараметрыМессенджер.Вставить("Бот",  			Бот);
	ПараметрыМессенджер.Вставить("ПараметрыПодключения", ПолучитьПараметрыПодключения(Бот));
			
	ДанныеВозврат.Добавить(ПараметрыМессенджер);
	
	Возврат ДанныеВозврат;
	
КонецФункции // ПолучитьНастройкиОтправкиЧерезМессенджер_Telegram_Произвольные()

Функция ОтправитьСообщениеЧерезМессенджер_Telegram(ПараметрыМессенджер)
	
	// тут копія вхідних параметрів, яку ми повернемо разом із результатами по кожній відправці сповіщення
	ПараметрыВозврат = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыМессенджер);
	ПараметрыВозврат.Вставить("Результаты", Новый Массив()); // вернем результаты отправки
	
	ПолучателиСообщения = ПараметрыВозврат.Кому;
	Для Каждого Получатель ИЗ ПолучателиСообщения Цикл
		
		ПараметрыПодключенияСервер = ПараметрыВозврат.ПараметрыПодключения;
	
		// запит
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("chat_id",  	Получатель.Адрес);
		ПараметрыЗапроса.Вставить("text",		ПараметрыВозврат.ТекстСообщения);
		
		ОтветСервера = Новый Соответствие();
		ОтветОк = ОправитьЗапросНаСерверТелеграм("sendMessage", ПараметрыПодключенияСервер, ПараметрыЗапроса, ОтветСервера);
	
		// результат отправки по каждому ИД
		ПараметрыВозврат.Результаты.Добавить(Новый Структура("Адрес, КодОтвета, ОтветДетально", 
														Получатель.Адрес, 
														ОтветОк, 
														ОтветСервера)
														);

	КонецЦикла;	
	  
    Возврат ПараметрыВозврат;
	
КонецФункции // ОтправитьСообщениеЧерезМессенджер_Telegram()


Функция ПолучитьПараметрыПодключения(Бот)
	
	НастойкиСтрокой = "АдресСервера, Порт, Таймаут, Токен";	
	
	Если Не ЗначениеЗаполнено(Бот) Тогда
		Возврат Новый Структура(НастойкиСтрокой);
	КонецЕсли;	
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Бот, НастойкиСтрокой);
	
КонецФункции	

#КонецОбласти


Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) 
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции	

#КонецОбласти
